#include <stdio.h>

#include <stdlib.h> // rand(),srand() 함수 사용을 위한 헤더파일입니다.

#include <windows.h>

#include <time.h> // time()함수 사용을 위한 헤더파일입니다.

void rsp_print_r(); // 주먹
void rsp_print_s(); // 가위
void rsp_print_p(); // 보자기

int main()

{
	 SetConsoleView();

int computer; // 컴퓨터가 낸 값을 저장합니다.

int user; // 사용자가 낸 값을 저장합니다.

int result[3] = {0, }; // 게임의 결과를 저장합니다.

int count = 0; // 게임의 횟수를 저장합니다. 0으로 초기화합니다.

srand((unsigned)time(NULL)); // rand 함수의 결과가 매번 다르도록 시드값을 지정합니다.

while(1) // 사용자가 종료할 때 까지 반복합니다.

{

computer = rand()%3+1; // 1~3 값 중 하나를 저장합니다.

printf("                     가위 바위 보 게임                  \n");

printf("(1. 가위  2. 바위  3. 보 _ 0. 종료)\n\n");

printf("입력해주세요 : ");

scanf("%d",&user);

if(user > 0 && user < 4) // 사용자가 1~3 값을 입력했을 경우입니다.

{

count++; // 정상적인 입력의 경우 게임 횟수를 증가시킵니다.


printf("\n컴퓨터 : %s\n", (computer  == 1 ? "가위" : computer  == 2 ? "바위" : "보"));

printf("사용자 : %s\n\n", (user == 1 ? "가위" : user == 2 ? "바위" : "보"));

if(computer == user) // 컴퓨터의 값과 사용자의 값이 같으면 비기는 경우입니다.

{

	printf("비겼습니다. \n\n");

	result[1]++; // 무승부 횟수를 증가시킵니다.

	if(user == 1) //가위
	{
		printf("\n\n");
		rsp_print_s();
	}

	else if(user == 2) // 주먹
	{
		printf("\n\n");
		rsp_print_r();
	}

	else if(user == 3) // 보자기
	{
		printf("\n\n");
		rsp_print_p();
	}
}// 지는 경우의 수입니다.

else if(((computer == 1) && (user == 3))  || ((computer == 2) && (user == 1)) || ((computer == 3) && (user == 2)))
{

printf("패배하였습니다.\n\n");

if(user == 1) //가위
	{
		printf("\n\n");
		rsp_print_s();
	}

	else if(user == 2) // 주먹
	{
		printf("\n\n");
		rsp_print_r();
	}

	else if(user == 3) // 보자기
	{
		printf("\n\n");
		rsp_print_p();
	}

result[2]++; // 패배 횟수를 증가시킵니다.

}

else // 나머지는 이긴 경우입니다.

{

printf("승리하였습니다.\n");

if(user == 1) //가위
	{
		printf("\n\n");
		rsp_print_s();
	}

	else if(user == 2) // 주먹
	{
		printf("\n\n");
		rsp_print_r();
	}

	else if(user == 3) // 보자기
	{
		printf("\n\n");
		rsp_print_p();
	}

result[0]++; // 승리 횟수를 증가시킵니다.

}

printf("%d전 %d승 %d무 %d패\n\n", count, result[0], result[1], result[2]);

}

else // 사용자가 입력한 값이 1, 2, 3이 아닌 경우

{

if(user == 0) // 사용자가 입력한 값이 0이면 종료합니다.
{

printf("게임을 종료합니다.\n");

break; // 종료

} // 그 외에는 예외처리 메세지 출력

printf("숫자를 제대로 입력해주세요\n\n");

}

system("pause"); // 일시정지 아무키나 누르면 진행됩니다.

system("cls"); // 화면 내용을 모두 지웁니다.

}

	return 0;
}

void rsp_print_r() // 주먹
{
         printf("            ,!!-      \n");
     printf("           ,=,...:=.--.   \n");
     printf("          .=,.....=#!=!.    \n");
     printf("          ;:......$....:=      \n");
     printf("         .=......-,.....-    \n");
     printf("         ;~......$......~;,,     \n");
     printf("         $......~.......-$;=$.     \n");
     printf("        ,!......$.......~:..-@    \n");
     printf("       .=:.....-,.......!....:$  \n");
     printf("     ;#$==-............!....,@ \n");
     printf("   =....,-!:~;.......,:.....@. \n");
     printf("  :$.........~=,......!......@=-\n");
     printf(" .@............:,.....:.....,.:, \n");
     printf(" ~:.............!....:,.....~,..$ \n");
     printf(" #...................;.........@  \n");
     printf(".$..................~,.....-;...@ \n");
     printf(",!....,~............!......!...,$ \n");
     printf("-~......;~,.....:..!,.....-~...=- \n");
     printf("~~........:!-,,~;.--......!....@.\n");
     printf("-!...........---!!@......!....:; \n");
     printf(".$...............@$,.........@  \n");
     printf(" #...............$.@::$.....!,  \n");
     printf(" -;..............;..,.,....: \n");
     printf(" .@....................,;::  \n");
     printf("  -=.......................;-  \n");
     printf("   !!......................# \n");
     printf("    ....................!; \n");
     printf("     ;$-.................;=  \n");
     printf("      -$=:,....--......-=.\n");
     printf("        ~$$$$=$!;;*$$: \n");
     printf("\n\n");
}

void rsp_print_s() // 가위
{
        printf("  ;!!.         .!:;$;    \n");
     printf(" .-....=.        =-....!~   \n");
     printf(" ;~......=       :;......=  \n");
     printf(" =,......!,     .$.......=.   \n");
     printf(" $-.......*     ~!.......,    \n");
     printf(" !;.......$.    =........=.  \n");
     printf(" -=.......;-   ,........=.   \n");
     printf("  =,......,!   ;-.......,! \n");
     printf("   -.......$   !........,  \n");
     printf("    .......=, .!........=  \n");
     printf("    -!......~: :-.......$,   \n");
     printf("     $....... ;.......=,  \n");
     printf("     :;......;,;......-  \n");
     printf("     ,#.......~.....;=~;!.  \n");
     printf("      #............,......=   \n");
     printf("     -=...-:;;;::::!.......=!!,  \n");
     printf("     =,.:=;,......,;:....-~..!.  \n");
     printf("    ,=,$:............;;...*...-;  \n");
     printf("    :;$...............#..~-....=   \n");
     printf("    #...............-:..=....,! \n");
     printf("    =!........~:~--~=~..$.....:,  \n");
     printf("    =;............!..-......!\n");
     printf("    ;..............,#,....,$ \n");
     printf("    ,#.................,--:=#, \n");
     printf("     !:....................~= \n");
     printf("     .#....................!. \n");
     printf("      ,#..................-#, \n");
     printf("       ~#~...............:$, \n");
     printf("        -#=~...,~~,....~=!.\n");
     printf("          .;==!;:,.;:~:;.\n");
     printf("\n\n");
}

void rsp_print_p() //보자기
{
     printf("                     -.   \n");
         printf("                   ,$$#;   \n");
     printf("                   $-.,$-  \n");
     printf("         .=@#;    -!...:*  \n");
     printf("         =..!~   !~...,$   \n");
     printf("         #....$   =,....$   .!#,  \n");
     printf("        .$....-,  $,....$   =,.;@. \n");
     printf("        .$.....$  #.....$  ;,...$:  \n");
     printf("         $.....#. $.....= ,;....*:  \n");
     printf("         *,....;- =....,= .....$-  \n");
     printf("        ::....,; !....~!,~.....#. \n");
     printf("        -=.....# ;....:-;.....:!  \n");
     printf("        .#.....#.~....!,~.....#.  \n");
     printf("         =-....;~-....!;.....~;  \n");
     printf("         :;.....#,...,:.....#.~~!#   \n");
     printf("         -=.....!....:.....:--,...=   \n");
     printf("         .$..........,-.....@-.....!  \n");
     printf("         .$.................~.......$  \n");
     printf("   ,=!~,=.........................;$  \n");
     printf("  :$-....!#~-......................-#-\n");
     printf("  @-......!**=-..................-#~  \n");
     printf(" ,@,...........-................~#.  \n");
     printf("  =#,..........................#=.\n");
     printf("   :@!...........,~............=*\n");
     printf("    .!@~..........!...........@,\n");
     printf("     ,#;.........,...........@\n");
     printf("      ,#,.................~=\n");
     printf("       :=.................#,\n");
     printf("       ,@,...............:#\n");
     printf("        !=..............~@, \n");
     printf("        .=!....~;,.....;@. \n");
     printf("          #$$#@=#=;;##. \n");
     printf("\n\n");
}
